In [30]:
from process.Extract import Extract
from process.Transform import Transform
from process.Load import Load
import pandas as pd

In [31]:
extract = Extract()
transform = Transform()
load = Load()

In [32]:
df_customers = extract.read_cloud_storage("datalake_proyecto_final","landing/customers")
df_orders = extract.read_cloud_storage("datalake_proyecto_final", "landing/orders") 
df_order_items = extract.read_cloud_storage("datalake_proyecto_final", "landing/order_items") 
df_departments = extract.read_cloud_storage("datalake_proyecto_final", "landing/departments") 
df_categories = extract.read_cloud_storage("datalake_proyecto_final","landing/categories") 
df_products = extract.read_cloud_storage("datalake_proyecto_final","landing/products")

In [33]:
df_enunciado1 = transform.enunciado1(df_customers, df_orders, df_order_items)

In [34]:
df_enunciado1.head()

,customer_id,customer_fname,customer_lname,customer_email,quantity_item_total,total
0,791,Mary,Smith,XXXXXXXXX,82,10524.17
1,8766,Mary,Duncan,XXXXXXXXX,87,9296.14
2,1657,Betty,Phillips,XXXXXXXXX,111,9223.71
3,2641,Betty,Spears,XXXXXXXXX,90,9130.92
4,1288,Evelyn,Thompson,XXXXXXXXX,89,9019.11

In [25]:
df_enunciado2 = transform.enunciado2(df_order_items, df_products,df_categories)

In [26]:
df_enunciado2.head()

         category_name  item_quantity   total
0          Accessories           5349  133671
1      As Seen on  TV!            206   20597
2  Baseball & Softball           1785   94057
3           Basketball             67   27099
4         Boxing & MMA           1265   85205

In [27]:
df_mi_enunciado = transform.mi_enunciado(df_customers, df_orders, df_order_items, df_products, df_categories)

In [28]:
df_mi_enunciado.head()

  customer_city    category_name
0     Aguadilla           Cleats
1       Alameda           Cleats
2        Albany  Women's Apparel
3   Albuquerque           Cleats
4     Algonquin           Cleats

In [17]:
df_enunciado3 = transform.enunciado3(df_customers, df_orders, df_order_items, df_products, df_categories)

In [18]:
df_enunciado4 = transform.enunciado4(df_customers, df_orders, df_order_items, df_products, df_categories)

In [19]:
load.load_to_cloud_storage(df_enunciado1,"datalake_proyecto_final", "gold/df_enunciado1")
load.load_to_cloud_storage(df_enunciado2,"datalake_proyecto_final", "gold/df_enunciado2")
load.load_to_cloud_storage(df_enunciado3,"datalake_proyecto_final", "gold/df_enunciado3")
load.load_to_cloud_storage(df_enunciado4,"datalake_proyecto_final", "gold/df_enunciado4")
load.load_to_cloud_storage(df_mi_enunciado,"datalake_proyecto_final", "gold/df_mi_enunciado")